lvx/base/Catalogs/бит_ВнутренниеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВнутренниеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВнутренниеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ИсторияИзмененияСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияИзмененияСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_ВнутренниеДокументы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Ключ.Пустая() Тогда
		СгенерироватьНаименованиеДокумента(Объект);
	КонецЕсли;
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Номер)
		И ШаблонДляНомераУстановлен Тогда
		ЗаполнитьЗначениеРеквизитаПоШаблону("Номер");
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		СгенерироватьНаименованиеДокумента(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыОповещения.Вставить("ВидДокумента", Объект.ВидДокумента);
	Оповестить("ЗаписьЭлементаСправочникабит_ВнутренниеДокументы", ПараметрыОповещения, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = УникальныйИдентификатор Тогда
		ЗаполнитьРеквизитыСтатусаВФорме();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	СгенерироватьНаименованиеДокумента(Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ОбновитьЭлементыДополнительныхРеквизитов();
	// Конец СтандартныеПодсистемы.Свойства
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СгенерироватьНаименованиеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СгенерироватьНаименованиеДокумента(Объект);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор",  Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура КомандаОтправитьНаСогласование(Команда)
	
	Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
	Если НЕ Записать() Тогда
		Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНомер(Команда)
	
	ОповещениеВопрос = Новый ОписаниеОповещения("ЗаполнитьНомерЗавершение", ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Номер) И НЕ ИзмененыЗначимыеРеквизиты("Номер") Тогда		
		ТекстВопроса = НСтр("ru = 'Перезаполнить номер?';
							|en = 'Are you sure you want to refill the number?'");
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);		
	Иначе		
		ВыполнитьОбработкуОповещения(ОповещениеВопрос, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ШаблонЗаполненияРеквизитов

&НаСервере
Процедура ПроверитьШаблоныЗаполненияРеквизитов()

	ШаблонДляНомераУстановлен = Ложь;
	
	ИмяРеквизита = "Номер";
	ИмяШаблона   = "СтруктураШаблона_Номер";
	
	// Поиск сохраненной структуры шаблона.
	Если СтруктураШаблоновЗаполненияРеквизитов = Неопределено Тогда
		СтруктураШаблоновЗаполненияРеквизитов = Новый Структура;
		СтруктураШаблоновЗаполненияРеквизитов.Вставить(ИмяШаблона);
	КонецЕсли;
	
	ПараметрыШаблонаТекущий = СтруктураШаблоновЗаполненияРеквизитов[ИмяШаблона];
	
	// Поиск новой структуры шаблона.
	// ++ ЕРП
	//ПараметрыШаблона = Справочники.бит_ШаблоныЗаполненияРеквизитов.СформироватьСтруктуруПараметровШаблона(Объект, ИмяРеквизита);
	ПараметрыШаблона = Неопределено;
	// -- ЕРП
	Если ПараметрыШаблона = Неопределено Тогда
		Элементы.Номер.ТолькоПросмотр     = Ложь;
		Элементы.ЗаполнитьНомер.Видимость = Ложь;
		Если ПараметрыШаблонаТекущий <> Неопределено Тогда
			СтруктураШаблоновЗаполненияРеквизитов.Вставить(ИмяШаблона, ПараметрыШаблона);
			Объект[ИмяРеквизита] = "";
		КонецЕсли;   	
	Иначе
		Элементы.Номер.ТолькоПросмотр     = Истина;
		Элементы.ЗаполнитьНомер.Видимость = Истина;
		СтруктураШаблоновЗаполненияРеквизитов.Вставить(ИмяШаблона, ПараметрыШаблона);
		
		Если ПараметрыШаблонаТекущий = Неопределено
			И ЗначениеЗаполнено(Объект.Номер)Тогда
			ЗапомнитьЗначенияЗначимыхРеквизитов(ИмяРеквизита);			
		КонецЕсли;	
	КонецЕсли;

	ШаблонДляНомераУстановлен = (СтруктураШаблоновЗаполненияРеквизитов["СтруктураШаблона_Номер"] <> Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьЗначенияЗначимыхРеквизитов(ИмяРеквизита)

	Если НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураШаблона = СтруктураШаблоновЗаполненияРеквизитов["СтруктураШаблона_Номер"];
	Если СтруктураШаблона <> Неопределено Тогда
		СтруктураЗначимыхРеквизитов = СтруктураШаблона.СтруктураЗначимыхРеквизитов;
		СтруктураЗначимыхРеквизитов = СтруктураШаблоновЗаполненияРеквизитов["СтруктураШаблона_Номер"].СтруктураЗначимыхРеквизитов;
		// ++ ЕРП
		//Справочники.бит_ШаблоныЗаполненияРеквизитов.ЗапомнитьЗначенияЗначимыхРеквизитов(Объект, СтруктураЗначимыхРеквизитов);
		// -- ЕРП
	КонецЕсли;
  	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
// 
&НаКлиенте
Процедура ЗаполнитьНомерЗавершение(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ЗаполнитьЗначениеРеквизитаПоШаблону("Номер");
		СгенерироватьНаименованиеДокумента(Объект);
		Модифицированность = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗначениеРеквизитаПоШаблону(ИмяРеквизита)
	
	СтруктураШаблона  = СтруктураШаблоновЗаполненияРеквизитов["СтруктураШаблона_Номер"];
	// ++ ЕРП
	//  ЗначениеРезультат = Справочники.бит_ШаблоныЗаполненияРеквизитов.СформироватьЗначениеРеквизитаПоШаблону(Объект,
	//																										ИмяРеквизита,
	//																										СтруктураШаблона);
	ЗначениеРезультат = Неопределено;
	// -- ЕРП
	Объект[ИмяРеквизита] = ЗначениеРезультат;
	Если СтруктураШаблона <> Неопределено Тогда
		ЗапомнитьЗначенияЗначимыхРеквизитов(ИмяРеквизита);
	КонецЕсли;
	
	Если ИмяРеквизита = "Номер" Тогда
		СгенерироватьНаименованиеДокумента(Объект);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ИзмененыЗначимыеРеквизиты(Знач ИмяРеквизита, Знач ПредставлениеЗаполняемогоРеквизита = Неопределено)

	Изменены = Ложь;
	Если ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
		СтруктураШаблона = СтруктураШаблоновЗаполненияРеквизитов["СтруктураШаблона_Номер"];
		Если СтруктураШаблона <> Неопределено Тогда
			
			СтруктураЗначимыхРеквизитов = СтруктураШаблона.СтруктураЗначимыхРеквизитов;
			
			// ++ ЕРП
			//Изменены = Справочники.бит_ШаблоныЗаполненияРеквизитов.ПроверитьИзмененияЗначимыхРеквизитов(Объект
			//					, СтруктураЗначимыхРеквизитов
			//					, ПредставлениеЗаполняемогоРеквизита);
			Изменены = Ложь;
			// -- ЕРП
		КонецЕсли;
	КонецЕсли;
	
	Возврат Изменены;

КонецФункции

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	ПроверитьШаблоныЗаполненияРеквизитов();
	
	Элементы.ФормаКомандаОтправитьНаСогласование.Заголовок = ?(Объект.ОтправленНаСогласование,
															НСтр("ru='Снять с согласования'"),
															НСтр("ru='Отправить на согласование'"));
	Элементы.ФормаКомандаОтправитьНаСогласование.Картинка = ?(Объект.ОтправленНаСогласование,
															БиблиотекаКартинок.Обсуждения,
															БиблиотекаКартинок.НовоеОбсуждение);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	                 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСтатусаВФорме()
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СгенерироватьНаименованиеДокумента(Объект)
	
	Объект.Наименование = бит_ДелопроизводствоКлиентСервер.АвтоНаименованиеВнутреннегоДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти
